Repository: viniciusddrft/Scanner-QRCode
Catalog: lib/core/l10n/app_*.arb
Languages: pt_br, zh

# homeToolTipView1
source: Read QRCode
pt_br: Ler QRCode
zh: 阅读二维码

# homeToolTipView2
source: Create QRCode
pt_br: Criar QRCode
zh: 创建二维码

# homeToolTipView3
source: Settings
pt_br: Configurações
zh: 设置

# readQRCodeTextButtonReadCamera
source: Read from camera
pt_br: Ler da camera
zh: 从相机读取

# readQRCodeTextButtonReadGallery
source: Read from gallery
pt_br: ler da galeria
zh: 从画廊阅读

# createQRCodeMenuText
source: Text
pt_br: Texto
zh: 文本

# createQRCodeMenuWifi
source: WiFi
zh: 无线上网

# createQRCodeMenuLink
source: Link
zh: 网页链接

# createQRCodeMenuContact
source: Contact
pt_br: Contato
zh: 联系电话

# createQRCodeMenuInstagram
source: Instagram
zh: TikTok

# createQRCodeMenuTiktok
source: TikTok
zh: Instagram

# createQRCodeTitleText
source: Create for text
pt_br: Criar para texto
zh: 为文本创建

# createQRCodeTitleWifi
source: Create for WiFi
pt_br: Criar para WiFi
zh: 为 WiFi 创建

# createQRCodeTitleLink
source: Create for link
pt_br: Criar para link
zh: 创建链接

# createQRCodeTitleContact
source: Create for contact
pt_br: Criar para contato
zh: 创建联系人

# createQRCodeTitleGithub
source: Create for Github
pt_br: Criar para Github
zh: 为 Github 创建

# createQRCodeTitleWhatsapp
source: Create for Whatsapp
pt_br: Criar para Whatsapp
zh: 为 Whatsapp 创建

# createQRCodeTitleInstagram
source: Create for Instagram
pt_br: Criar para Instagram
zh: 为 Instagram 创作

# createQRCodeTitleTiktok
source: Create for TikTok
pt_br: Criar para TikTok
zh: 为 TikTok 创建

# createQRCodeTitleFacebook
source: Create for Facebook
pt_br: Criar para Facebook
zh: 为 Facebook 创建

# createQRCodeTitleYoutube
source: Create for Youtube
pt_br: Criar para Youtube
zh: 为 Youtube 创建

# createQRCodeTitleTwitter
source: Create for Twitter
pt_br: Criar para Twitter
zh: 为 Twitter 创建

# createQRCodeTitleTwitch
source: Create for Twitch
pt_br: Criar para Twitch
zh: 为 Twitch 创建

# createQRCodeTitleReddit
source: Create for Reddit
pt_br: Criar para Reddit
zh: 为 reddit 创建

# createQRCodeALLButton
source: Create QRCode
pt_br: Criar QRCode
zh: 创建二维码

# createQRCodeTextLabelDecorate
source: Write
pt_br: Digite
zh: 写

# createQRCodeTextValidatorError
source: can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeContactNameLabelDecorate
source: Name
pt_br: Nome
zh: 姓名

# createQRCodeContactNameValidatorError
source: can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeContactPhoneLabelDecorate
source: Number
pt_br: Número
zh: 数字

# createQRCodeContactPhoneValidatorError
source: can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeWhatsappLabelDecorate
source: Number
pt_br: Número
zh: 数字

# createQRCodeWhatsappValidatorError
source: can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeInstagramMsg
source: Put your Instagram link or username (without the @) and the QR code will point directly to your profile.
pt_br: Coloque seu link ou nome de usuário do Instagram (sem o @) e o código QR apontará diretamente para o seu perfil.
zh: 输入您的 Instagram 链接或用户名（不带 @），二维码将直接指向您的个人资料。

# createQRCodeInstagramValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeWiFiMsg1
source: The generated QR code will make it easier for you to join the Wi-Fi network simply by scanning the QR code.
pt_br: O código QR gerado tornará mais fácil para você entrar na rede Wi-Fi simplesmente digitalizando o código QR.
zh: 生成的二维码将使您只需扫描二维码即可更轻松地加入 Wi-Fi 网络。

# createQRCodeWiFiMsg2
source: Enter your network type:
pt_br: Coloque o tipo da sua rede:
zh: 输入您的网络类型：

# createQRCodeWiFiLabelDecorate1
source: Network name
pt_br: Nome da rede
zh: 网络名字

# createQRCodeWiFiValidatorError1
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeWiFiLabelDecorate2
source: Password
pt_br: Senha
zh: 密码

# createQRCodeWiFiValidatorError2
source: At least 8 characters
pt_br: Pelo menos 8 caracteres
zh: 至少 8 个字符

# createQRCodeTiktokMsg
source: Enter your TikTok link or username (without the @) and the QR code will point directly to your profile.
pt_br: Coloque o seu link ou seu nome de usuário do TikTok (sem o @) e o código QR apontará diretamente para o seu perfil.
zh: 输入您的 TikTok 链接或用户名（不带 @），二维码将直接指向您的个人资料。

# createQRCodeTiktokValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeFacebookMsg1
source: Paste the facebook link or enter your id
pt_br: Cole o link do facebook ou coloque seu id
zh: 粘贴 Facebook 链接或输入您的 ID

# createQRCodeFacebookMsg2
source: Example id : https://www.facebook.com/*******.*******.***'
pt_br: Exemplo de id : https://www.facebook.com/*******.*******.***
zh: 示例 ID：https://www.facebook.com/*******.*******.***'

# createQRCodeFacebookMsg3
source: Id would be this part with * that is in the link of your profile or profile of your page.
pt_br: Id seria essa parte com * que está no link do seu perfil ou perfil da sua pagina.
zh: Id 将是带有 * 的部分，可以在您的个人资料链接或页面个人资料中找到。

# createQRCodeFacebookLabelDecorate
source: Write
pt_br: Digite
zh: 写

# createQRCodeFacebookValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeYoutubeMsg1
source: Paste the video or channel link, if you want you can put the id of some video
pt_br: Cole o link do video ou do canal, se quiser pode colocar o id de algum video
zh: 粘贴视频或频道链接，如果需要可以放一些视频的id

# createQRCodeYoutubeMsg2
source: Example id: https://www.youtube.com/watch?v=***********
pt_br: Exemplo de id : https://www.youtube.com/watch?v=***********
zh: 示例 ID：https://www.youtube.com/watch?v=***********

# createQRCodeYoutubeMsg3
source: Id would be this part with * that is in the video link.
pt_br: Id seria essa parte com * que está no link do video.
zh: Id 将是视频链接中带有 * 的这部分。

# createQRCodeYoutubeLabelDecorate
source: Write
pt_br: Digite
zh: 写

# createQRCodeYoutubeValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeTwitterMsg
source: Put the link to your profile or your username and the qrcode will take you to your profile
pt_br: Coloque o link do seu perfil ou seu username e o qrcode levara ao seu perfil
zh: 将链接放入您的个人资料或您的用户名，二维码将带您进入您的个人资料

# createQRCodeTwitterValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeTwitchMsg
source: Put the link to the live or the name of the author of the live.
pt_br: Coloque o link do live ou o nome do autor do live.
zh: 把直播链接或者直播作者的名字。

# createQRCodeTwitchLabelDecorate
source: Write
pt_br: Digite
zh: 写

# createQRCodeTwitchValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeRedditMsg1
source: Link to your profile or reddit page or enter the id
pt_br: Coloque o link do seu perfil ou da pagina do reddit ou coloque o id
zh: 链接到您的个人资料或 reddit 页面或输入 ID

# createQRCodeRedditMsg2
source: example: r/*** | u/***
pt_br: exemplo : r/*** | u/***
zh: 例如：r/*** |你/***

# createQRCodeRedditLabelDecorate
source: Write
pt_br: Digite
zh: 写

# createQRCodeRedditValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeGithubMsg
source: Put your link or github user and the qrcode will take you to your profile.
pt_br: Coloque seu link ou usuario do github e o qrcode levara ao seu perfil.
zh: 输入您的链接或 github 用户，二维码将带您进入您的个人资料。

# createQRCodeGithubLabelDecorate
source: Write
pt_br: Digite
zh: 写

# createQRCodeGithubValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createQRCodeLinkMsg
source: With or without (https://).
pt_br: Com ou sem o (https://).
zh: 有或没有（https：//）。

# createQRCodeLinkValidatorError
source: Can't be empty
pt_br: Não pode ficar vazio
zh: 不能为空

# createResultQRCodeAppBarTitle
source: Ready
pt_br: Pronto
zh: 准备好

# createResultQrCodeButtonSave
source: Save
pt_br: Salvar
zh: 保存

# createResultQrCodeButtonShare
source: Share
pt_br: Compartilhar
zh: 分享它

# createResultQrPopupSave
source: Saved
pt_br: Salvo
zh: 已保存

# createResultQrPopupError
source: Error
pt_br: Erro
zh: 错误

# scanViewTooltip1
source: Back
pt_br: Voltar
zh: 后退

# scanViewTooltip2
source: Turn on flash
pt_br: Ligar flash
zh: 打开闪光灯

# scanViewTooltip3
source: Turn off flash
pt_br: Desligar flash
zh: 关闭闪光灯

# scanViewTooltip4
source: Change camera
pt_br: Trocar camera
zh: 切换镜头

# scanResultQrTitle
source: Result
pt_br: Resultado
zh: 结果

# scanResultQrButtonShare
source: Share
pt_br: Compartilhar
zh: 分享它

# scanResultQrButtonOpen
source: Open
pt_br: Abir
zh: 打开

# scanResultQrToolTip
source: Copy
pt_br: Copiar
zh: 复制

# scanResultPopupCopy
source: Copied
pt_br: Copiado
zh: 已复制

# scanResultpopupError
source: Some error happened
pt_br: Aconteceu algum erro
zh: 发生了一些错误

# settingsVersion
source: Version
pt_br: Versão
zh: 版本

# settingsTitleCardCreateQrCode
source: Creating QRCode
pt_br: Criação de QRCode
zh: 二维码制作

# settingsButtonColorbackground
source: Current background color
pt_br: Cor de fundo
zh: 背景颜色

# settingsButtonColorCode
source: Current code color
pt_br: Cor do código
zh: 代码颜色

# settingsButtonColorEye
source: Current border color
pt_br: Cor da borda
zh: 边框颜色

# settingsButtonShapeEyeQR
source: Edge type
pt_br: Tipo de borda
zh: 边缘类型

# settingsButtonShapeQR
source: QRCode Body
pt_br: Corpo do QRcode
zh: 身体二维码

# settingsImage
source: Image
pt_br: Imagem
zh: 图片

# settingsImageTooltipAdd
source: Add image in qr code
pt_br: Adicionar imagem no código qr
zh: 在二维码中添加图像

# settingsImageTooltipRemove
source: Remove image in qr code
pt_br: Remover imagem no código qr
zh: 删除二维码中的图像

# settingsPopupColorEyeTitle
source: Choose the type of border
pt_br: Escolha o tipo de borda
zh: 选择边框类型

# settingsPopupColorShapeTitle
source: Choose your body type
pt_br: Escolha o tipo de corpo
zh: 选择你的体型

# settingsPopupColorTitle
source: Choose color
pt_br: Escolha a cor
zh: 选择颜色

# settingsPopupButtonCancel
source: Cancel
pt_br: Cancelar
zh: 取消

# settingsLanguageTitle
source: Language
pt_br: Idioma
zh: 语

# settingsLanguagePopup
source: Languages
pt_br: Idiomas
zh: 语言

# settingsLanguageNameBrasil
source: Brazilian Portuguese
pt_br: Português do Brasil
zh: 巴西葡萄牙语

# settingsLanguageNameUnitedStates
source: United States English
pt_br: Inglês dos Estados Unidos
zh: 美国英语

# settingsLanguageNameChina
source: Chinese from China
pt_br: Chinês da China
zh: 来自中国的中国人

# settingsPupupContinue
source: Continue
pt_br: Continuar
zh: 继续

# settingsQRCodeExample
source: QR code Example
pt_br: QR code Exemplo
zh: 二维码示例

# settingsQRCodeDownloadPremiumVersion
source: Download Premium
pt_br: Baixar versão premium
zh: 下载高级版

# settingsContact
source: Contact
pt_br: Contato
zh: 接触

# settingsHelp
source: Help
pt_br: Ajuda
zh: 帮助

# settingsFrequentProblems
source: Frequent problems
pt_br: Problemas frequentes
zh: 常见问题

# settingsAboutTheApp
source: About the app
pt_br: Sobre o app
zh: 关于应用程序

# settingsRateTheApp
source: Rate the app
pt_br: Avalie o app
zh: 评价应用程序

# settingsApptheme
source: App theme
pt_br: Tema do app
zh: 应用主题

# settingsChooseTheTheme
source: Choose the theme
pt_br: Escolha o tema
zh: 选择主题

# settingsChangeTheme
source: Change theme
pt_br: Trocar tema
zh: 更改主题

# settingsSystemTheme
source: System theme
pt_br: Tema do sistema
zh: 系统主题

# settingsLightTheme
source: Light theme
pt_br: Tema claro
zh: 轻主题

# settingsDarkTheme
source: Dark theme
pt_br: Tema escuro
zh: 黑暗主题

# helpProblem1
source: The qr code I created was not read
pt_br: O qr code que eu criei não foi lido
zh: 我创建的二维码没有被读取

# helpSolution1
source: When this happens it could be like cores that were used or the logo, unfortunately this will have to be tested by you but if your qr code doesn't work just test some modifications and you will probably be able to do it quietly.
pt_br: Quando isso acontece pode ser as cores que foram utilizadas ou o logo, infelizmente isso terá que ser testado por você mas se seu qr code não funcionar basta testar umas modificações e provavelmente conseguira fazer tranquilamente.
zh: 当这种情况发生时，它可能就像使用的内核或徽标一样，不幸的是，这必须由您进行测试，但如果您的二维码不起作用，只需测试一些修改，您可能就可以安静地进行。

# helpProblem2
source: Types of readable codes?
pt_br: Tipos de códigos legíveis?
zh: 可读代码的类型？

# helpSolution2
source: Linear formats: Codabar, Code 39, Code 93, Code 128, EAN-8, EAN-13, ITF, UPC-A, UPC-E 2D formats: Aztec, Data Matrix, PDF417, QR Code
pt_br: Formatos lineares: Codabar, Código 39, Código 93, Código 128, EAN-8, EAN-13, ITF, UPC-A, UPC-E Formatos 2D: Aztec, Data Matrix, PDF417, QR Code
zh: 线性格式：Codabar、Code 39、Code 93、Code 128、EAN-8、EAN-13、ITF、UPC-A、UPC-E 2D 格式：Aztec、Data Matrix、PDF417、QR Code

# helpProblem3
source: Types of unreadable codes?
pt_br: Tipos de códigos não legíveis?
zh: 不可读代码的类型？

# helpSolution3
source: 1D Barcodes with only one character Barcodes in ITF format with fewer than six characters Barcodes encoded with FNC2, FNC3 or FNC4 QR codes generated in the ECI mode
pt_br: Códigos de barras 1D com apenas um caractere Códigos de barras no formato ITF com menos de seis caracteres Códigos de barras codificados com FNC2, FNC3 ou FNC4 Códigos QR gerados no modo ECI
zh: 只有一个字符的一维条码 少于六个字符的 ITF 格式条码 使用 FNC2、FNC3 或 FNC4 编码的条码 ECI模式下生成的二维码
